export const sellerLineGraph = [
  {
    id: "월 수익 금액",
    color: "hsl(324, 70%, 50%)",
    data: [
      {
        x: "판매자 등록",
        y: 0,
      },
      {
        x: "2021년 5월",
        y: 12034,
      },
      {
        x: "2021년 6월",
        y: 29871,
      },
      {
        x: "2021년 7월",
        y: 10234,
      },
      {
        x: "2021년 8월",
        y: 8900,
      },
      {
        x: "2021년 9월",
        y: 20192,
      },
      {
        x: "2021년 10월",
        y: 18293,
      },
      {
        x: "2021년 11월",
        y: 34012,
      },
    ],
  },
  {
    id: "총 수익 금액",
    color: "hsl(211, 70%, 50%)",
    data: [
      {
        x: "판매자 등록",
        y: 0,
      },
      {
        x: "2021년 5월",
        y: 12034,
      },
      {
        x: "2021년 6월",
        y: 41905,
      },
      {
        x: "2021년 7월",
        y: 52139,
      },
      {
        x: "2021년 8월",
        y: 61039,
      },
      {
        x: "2021년 9월",
        y: 81231,
      },
      {
        x: "2021년 10월",
        y: 99524,
      },
      {
        x: "2021년 11월",
        y: 133536,
      },
    ],
  },
  {
    id: "Sleepy 업체 평균 수익",
    color: "hsl(211, 70%, 50%)",
    data: [
      {
        x: "2021년 5월",
        y: 12102,
      },
      {
        x: "2021년 6월",
        y: 14131,
      },
      {
        x: "2021년 7월",
        y: 9224,
      },
      {
        x: "2021년 8월",
        y: 20324,
      },
      {
        x: "2021년 9월",
        y: 14304,
      },
      {
        x: "2021년 10월",
        y: 21002,
      },
      {
        x: "2021년 11월",
        y: 23009,
      },
    ],
  },
];

export const sellerPieGraph = [
  {
    id: "수면용품",
    label: "수면용품",
    value: 542,
    color: "hsl(272, 70%, 50%)",
  },
  {
    id: "배게",
    label: "배게",
    value: 518,
    color: "hsl(199, 70%, 50%)",
  },
  {
    id: "잠옷",
    label: "잠옷",
    value: 403,
    color: "hsl(119, 70%, 50%)",
  },
  {
    id: "오일",
    label: "오일",
    value: 327,
    color: "hsl(272, 70%, 50%)",
  },
  {
    id: "이불",
    label: "이불",
    value: 239,
    color: "hsl(321, 70%, 50%)",
  },
  {
    id: "도서",
    label: "도서",
    value: 220,
    color: "hsl(67, 70%, 50%)",
  },
  {
    id: "암막커튼",
    label: "암막커튼",
    value: 183,
    color: "hsl(272, 70%, 50%)",
  },

  {
    id: "수면보조제",
    label: "수면보조제",
    value: 97,
    color: "hsl(272, 70%, 50%)",
  },
];
